ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2040/ZuluIDE_platform.cpp
    logmsg("Platform: ", g_platform_name);
    logmsg("FW Version: ", g_log_firmwareversion);

    logmsg("DIP switch settings: cablesel ", (int)g_dip_cable_sel, ", drive_id ", (int)g_dip_drive_id, " debug log ", (int)dbglog);

    g_log_debug = dbglog;


    // Get flash chip size
    uint8_t cmd_read_jedec_id[4] = {0x9f, 0, 0, 0};
    uint8_t response_jedec[4] = {0};
    flash_do_cmd(cmd_read_jedec_id, response_jedec, 4);
    g_flash_chip_size = (1 << response_jedec[3]);
    logmsg("Flash chip size: ", (int)(g_flash_chip_size / 1024), " kB");

    // Get flash chip unique ID
    // (flash_get_unique_id() from RP2040 libs didn't work for some reason)
    uint8_t cmd_read_uniq_id[13] = {0x4B};
    uint8_t response_uniq_id[13] = {0};
    flash_do_cmd(cmd_read_uniq_id, response_uniq_id, 13);
    memcpy(&g_flash_unique_id, response_uniq_id + 5, 8);
    logmsg("Flash unique ID: ", g_flash_unique_id);

    // SD card pins
    // Card is used in SDIO mode, rp2040_sdio.cpp will redirect these to PIO1
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(SDIO_CLK,       GPIO_FUNC_SIO, true, false, true,  true, true);
    gpio_conf(SDIO_CMD,       GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D0,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D1,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D2,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D3,        GPIO_FUNC_SIO, true, false, false, true, true);

    // I2C pins
    //        pin                 function       pup   pdown  out    state fast
    gpio_conf(GPIO_I2C_SCL,       GPIO_FUNC_I2C, true, false, false,  true, true);
    gpio_conf(GPIO_I2C_SDA,       GPIO_FUNC_I2C, true, false, false,  true, true);

    // FPGA bus
    // Signals will be switched between SPI/PIO by rp2040_fpga.cpp, but pull-ups are configured here.
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(FPGA_CLK,       GPIO_FUNC_GPCK,false,false, true,  false, true);
    gpio_conf(FPGA_CRESET,    GPIO_FUNC_SIO, false,false, true,  false, false);
    gpio_conf(FPGA_CDONE,     GPIO_FUNC_SIO, true, false, false, false, false);
    gpio_conf(FPGA_SS,        GPIO_FUNC_SIO, true, false, true,  true,  false);
    gpio_conf(FPGA_QSPI_SCK,  GPIO_FUNC_SIO, false,false, true,  false, true);
    gpio_conf(FPGA_QSPI_D0,   GPIO_FUNC_SIO, true, false, true,  false, true);
    gpio_conf(FPGA_QSPI_D1,   GPIO_FUNC_SIO, true, false, true,  false, true);
    gpio_conf(FPGA_QSPI_D2,   GPIO_FUNC_SIO, true, false, true,  false, true);
    gpio_conf(FPGA_QSPI_D3,   GPIO_FUNC_SIO, true, false, true,  false, true);

    // IDE initialization status signals
    gpio_conf(IDE_CSEL_IN,    GPIO_FUNC_SIO, false,false, false, false, false);
    gpio_conf(IDE_PDIAG_IN,   GPIO_FUNC_SIO, false,false, false, false, false);
    gpio_conf(IDE_DASP_IN,    GPIO_FUNC_SIO, false,false, false, false, false);

    // Status LED
    gpio_conf(STATUS_LED,     GPIO_FUNC_SIO, false,false, true,  false, false);
}

// late_init() only runs in main application
void platform_late_init()
{
    dbgmsg("Loading FPGA bitstream");
    if (fpga_init())
    {
        logmsg("FPGA initialization succeeded");
    }
    else
    {
        logmsg("ERROR: FPGA initialization failed");
    }
#ifdef ENABLE_AUDIO_OUTPUT
    logmsg("I2S audio to expansion header enabled");
    reclock_for_audio();
    logmsg("-- System clock is set to ", (int) clock_get_hz(clk_sys),  "Hz");
#endif
#ifdef ENABLE_AUDIO_OUTPUT
    // one-time control setup for DMA channels and second core
    audio_init();
    audio_set_max_volume((uint8_t) ini_getl("IDE", "max_volume", 100, CONFIGFILE));
#endif
    platform_check_for_controller();
    __USBStart();
}

uint8_t platform_check_for_controller()
{
  static bool checked = false;
  static uint8_t controller_found = 0;
  if (checked) return controller_found;
  g_wire.setClock(100000);
  // Setting the drive strength seems to help the I2C bus with the Pico W controller and the controller OLED display
  // to communicate and handshake properly
  gpio_set_drive_strength(GPIO_I2C_SCL, GPIO_DRIVE_STRENGTH_12MA);
  gpio_set_drive_strength(GPIO_I2C_SDA, GPIO_DRIVE_STRENGTH_12MA);

  g_rotary_input.SetI2c(&g_wire);
  bool hasHardwareUI = g_rotary_input.CheckForDevice();
  g_I2cServer.SetI2c(&g_wire);
  bool hasI2CServer = g_I2cServer.CheckForDevice();
  logmsg(hasHardwareUI ? "Hardware UI found." : "Hardware UI not found.");
  logmsg(hasI2CServer ? "I2C server found" : "I2C server not found");
  controller_found = (hasHardwareUI ? CONTROLLER_TYPE_BOARD : 0) | (hasI2CServer ? CONTROLLER_TYPE_WIFI : 0);
  checked = true;
  return controller_found;
}

void platform_set_status_controller(zuluide::ObserverTransfer<zuluide::status::SystemStatus> *statusController) {
  logmsg("Initialized platform controller with the status controller.");
  display.init(&g_wire);
  statusController->AddObserver(processStatusUpdate);
  uiStatusController = statusController;
}

void platform_set_filename_response_pipe(zuluide::pipe::ImageResponsePipe *fnRequestPipe) {
    logmsg("Initialized platform with filename request pipe");
    filenameResponsePipe = fnRequestPipe;
}

void platform_set_display_controller(zuluide::Observable<zuluide::control::DisplayState>& displayController) {
  logmsg("Initialized platform controller with the display controller.");
  displayController.AddObserver([&] (auto current) -> void {display.HandleUpdate(current);});  
}

void platform_set_input_interface(zuluide::control::InputReceiver* inputReceiver) {
  logmsg("Initialized platform controller with input receiver.");
  g_rotary_input.SetReciever(inputReceiver);
  g_rotary_input.StartSendingEvents();
}

void platform_set_device_control(zuluide::status::DeviceControlSafe* deviceControl) {
  logmsg("Initialized platform with device control.");
  char iniBuffer[100];
  memset(&iniBuffer, 0, 100);
  if (ini_gets("UI", "wifissid", "", iniBuffer, sizeof(iniBuffer), CONFIGFILE) > 0) {
    auto ssid = std::string(iniBuffer);
    g_I2cServer.SetSSID(ssid);
    logmsg("Set SSID from INI file to ", ssid.c_str());
  }

  memset(&iniBuffer, 0, 100);
  if (ini_gets("UI", "wifipassword", "", iniBuffer, sizeof(iniBuffer), CONFIGFILE) > 0) {
    auto wifiPass = std::string(iniBuffer);
    g_I2cServer.SetPassword(wifiPass);
    logmsg("Set PASSWORD from INI file.");
  }

