ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2040/ZuluIDE_platform.cpp
#ifdef ENABLE_AUDIO_OUTPUT
    /*
    * If ADC sample reads are done, either via direct reading, FIFO, or DMA,
    * at the same time a SPI DMA write begins, it appears that the first
    * 16-bit word of the DMA data is lost. This causes the bitstream to glitch
    * and audio to 'pop' noticably. For now, just disable ADC reads when audio
    * is playing.
    */
   if (audio_is_active()) return;
#endif  // ENABLE_AUDIO_OUTPUT

    int adc_value_max = 0;
    while (!adc_fifo_is_empty())
    {
        int adc_value = adc_fifo_get();
        if (adc_value > adc_value_max) adc_value_max = adc_value;
    }

    // adc_value = 700mV * 4096 / Vdd
    // => Vdd = 700mV * 4096 / adc_value
    // To avoid wasting time on division, compare against
    // limit directly.
    const int limit = (700 * 4096) / PLATFORM_VDD_WARNING_LIMIT_mV;
    if (adc_value_max > limit)
    {
        // Warn once, and then again if we detect even a lower drop.
        int vdd_mV = (700 * 4096) / adc_value_max;
        if (vdd_mV < lowest_vdd_seen)
        {
            logmsg("WARNING: Detected supply voltage drop to ", vdd_mV, "mV. Verify power supply is adequate.");
            lowest_vdd_seen = vdd_mV - 50; // Small hysteresis to avoid excessive warnings
        }
    }
#endif
}

// This function is called for every log message.
void platform_log(const char *s)
{
    if (g_uart_initialized)
    {
        uart_puts(uart0, s);
    }
}

static int g_watchdog_timeout;
static bool g_watchdog_initialized;
static bool g_watchdog_did_bus_reset;

void ide_phy_reset_from_watchdog();

static void watchdog_callback(unsigned alarm_num)
{
    g_watchdog_timeout -= 1000;

    if (g_watchdog_timeout < WATCHDOG_CRASH_TIMEOUT - 1000)
    {
        // Been stuck for at least a second, start dumping USB log
        usb_log_poll();
    }

    if (g_watchdog_timeout <= WATCHDOG_CRASH_TIMEOUT - WATCHDOG_BUS_RESET_TIMEOUT)
    {
        if (!g_watchdog_did_bus_reset)
        {
            logmsg("--------------");
            logmsg("WATCHDOG TIMEOUT, attempting bus reset");
            logmsg("GPIO states: out ", sio_hw->gpio_out, " oe ", sio_hw->gpio_oe, " in ", sio_hw->gpio_in);

            uint32_t msp;
            asm volatile ("MRS %0, msp" : "=r" (msp) );
            uint32_t *p =  (uint32_t*)msp;
            for (int i = 0; i < 16; i++)
            {
                if (p == &__StackTop) break; // End of stack

                logmsg("STACK ", (uint32_t)p, ":    ", p[0], " ", p[1], " ", p[2], " ", p[3]);
                p += 4;
            }

            g_watchdog_did_bus_reset = true;
            ide_phy_reset_from_watchdog();
        }

        if (g_watchdog_timeout <= 0)
        {
            logmsg("--------------");
            logmsg("WATCHDOG TIMEOUT!");
            logmsg("Platform: ", g_platform_name);
            logmsg("FW Version: ", g_log_firmwareversion);
            logmsg("GPIO states: out ", sio_hw->gpio_out, " oe ", sio_hw->gpio_oe, " in ", sio_hw->gpio_in);

            uint32_t msp;
            asm volatile ("MRS %0, msp" : "=r" (msp) );
            uint32_t *p =  (uint32_t*)msp;
            for (int i = 0; i < 16; i++)
            {
                if (p == &__StackTop) break; // End of stack

                logmsg("STACK ", (uint32_t)p, ":    ", p[0], " ", p[1], " ", p[2], " ", p[3]);
                p += 4;
            }

            fpga_dump_ide_regs();

            usb_log_poll();
            platform_emergency_log_save();

#ifndef RP2040_DISABLE_BOOTLOADER
           platform_boot_to_main_firmware();
#else
            // copied from CMSIS's __NVIC_SystemReset();
            asm volatile ("dsb 0xF":::"memory");
            scb_hw->aircr  = ((0x5FAUL << 16U) | 1UL << 2U);
            asm volatile ("dsb 0xF":::"memory");
            while(true);
#endif
        }
    }

    hardware_alarm_set_target(alarm_num, delayed_by_ms(get_absolute_time(), 1000));
}

// This function can be used to periodically reset watchdog timer for crash handling.
// It can also be left empty if the platform does not use a watchdog timer.
void platform_reset_watchdog()
{
    g_watchdog_timeout = WATCHDOG_CRASH_TIMEOUT;
    g_watchdog_did_bus_reset = false;
    if (!g_watchdog_initialized)
    {
        int alarm_num = -1;
        for (int i = 0; i < NUM_GENERIC_TIMERS; i++)
        {
            if (!hardware_alarm_is_claimed(i))
            {
                alarm_num = i;
                break;
            }
        }
        if (alarm_num == -1)
        {
            logmsg("No free watchdog hardware alarms to claim");
            return;
        }
        hardware_alarm_claim(alarm_num);
        hardware_alarm_set_callback(alarm_num, &watchdog_callback);
        hardware_alarm_set_target(alarm_num, delayed_by_ms(get_absolute_time(), 1000));
        g_watchdog_initialized = true;
    }

    // USB log is polled here also to make sure any log messages in fault states
    // get passed to USB.
    usb_log_poll();
}
// Install FPGA license key to RP2040 flash
// buf is pointer to hex string with 26 bytes (encoding 13 bytes)
bool install_license(char *buf)
{
    uint8_t key[256] = {0};
    for (int i = 0; i < 13; i++)
    {
        char tmp[3] = {buf[i * 2], buf[i * 2 + 1], 0};
        key[i] = strtoull(tmp, NULL, 16);
    }

    if (memcmp(key, PLATFORM_LICENSE_KEY_ADDR, 32) == 0)
    {
        logmsg("---- License key matches the one already installed");
        return true;
    }


    reclock_to_default();
    // Make a test run with the license key and wait for FPGA to validate it
    logmsg("---- Testing new license key..");
    fpga_init(true, false);
    fpga_wrcmd(FPGA_CMD_LICENSE_AUTH, key, 32);
    for (int i = 0; i < 20; i++)
    {
        usb_log_poll();
        delay(100);
    }

    // Check validation results
    uint8_t status;
    fpga_rdcmd(FPGA_CMD_LICENSE_CHECK, &status, 1);

#ifdef ENABLE_AUDIO_OUTPUT
    reclock_for_audio();
#endif

    if (status < 0x80 || status > 0x84)
    {
        logmsg("---- New license key is not valid for this device, not installing (status ", status, ")");
        return false;
    }
    else
    {
        logmsg("---- New license key accepted, writing to flash (status ", status, ")");
    }

    usb_log_poll();

    // Write to RP2040 flash
    uint32_t saved_irq = save_and_disable_interrupts();
    flash_range_erase(PLATFORM_LICENSE_KEY_OFFSET, PLATFORM_FLASH_PAGE_SIZE);
    flash_range_program(PLATFORM_LICENSE_KEY_OFFSET, key, 256);
    restore_interrupts(saved_irq);

    if (memcmp(key, PLATFORM_LICENSE_KEY_ADDR, 32) == 0)
    {
        logmsg("---- Flash write successful");
        return true;
    }
    else
    {
        logmsg("---- Flash compare failed: ", bytearray(key, 5), " vs. ", bytearray(PLATFORM_LICENSE_KEY_ADDR, 5));
        return false;
    }
}

void usb_command_handler(char *cmd)
{
    if (strncasecmp(cmd, "license ", 8) == 0)
    {
        logmsg("-- Installing new license key received from USB port");
        char *p = cmd + 8;
        while (isspace(*p)) p++;

        if (strlen(p) < 26)
        {
            logmsg("---- License key too short: ", p);
        }
        else
        {
            install_license(p);
        }
    }
}

// Poll for commands sent through the USB serial port
void usb_command_poll()
{
    static uint8_t rx_buf[64];
    static int rx_len;

    uint32_t available = Serial.available();
    if (available > 0)
    {
        available = std::min<uint32_t>(available, sizeof(rx_buf) - rx_len);
        Serial.readBytes(rx_buf + rx_len, available);
        rx_len += available;
    }

    if (rx_len > 0)
    {
        char *first = (char*)rx_buf;
        for (int i = 0; i < rx_len; i++)
        {
            if (rx_buf[i] == '\n' || rx_buf[i] == '\r')
            {
                // Got complete line
                rx_buf[i] = '\0';
                usb_command_handler(first);
                rx_len = 0;
            }
            else if (isspace(*first))
            {
                first++;
            }
        }

        if (rx_len == sizeof(rx_buf))
        {
            // Too long line, discard
            rx_len = 0;
        }
    }
}

// Poll function that is called every few milliseconds.
// Can be left empty or used for platform-specific processing.
void platform_poll()
{
    static uint32_t prev_poll_time;
    static bool license_log_done = false;
    static bool license_from_sd_done = false;

    // No point polling the USB hardware more often than once per millisecond
    uint32_t time_now = millis();
    if (time_now == prev_poll_time)
    {
        return;
    }
    prev_poll_time = time_now;

    // Check if there is license file on SD card
    if (!license_from_sd_done && g_sdcard_present)
    {
        license_from_sd_done = true;

        if (SD.exists(LICENSEFILE))
        {
            char buf[26];
            FsFile f = SD.open(LICENSEFILE, O_RDONLY);
            if (f.read(buf, 26) == 26)
            {
                logmsg("-- Found license key file ", LICENSEFILE);
                install_license(buf);
            }
            f.close();
            SD.remove(LICENSEFILE);
        }
    }

    // Log FPGA license status after initial delay from boot
    if (!license_log_done && time_now >= 2000)
    {
        uint8_t response[21];
        fpga_rdcmd(FPGA_CMD_LICENSE_CHECK, response, 21);
        logmsg("FPGA license request code: ",
            bytearray((uint8_t*)&g_flash_unique_id, 8),
            bytearray(response + 1, 4),
            bytearray(response + 16, 5));

        if (response[0] == 0 || response[0] == 0xFF)
        {
            logmsg("-------------------------------------------------");
            logmsg("ERROR: FPGA license check failed with status ", response[0]);
            logmsg("       Please contact customer support and provide this log file and proof of purchase.");
            logmsg("-------------------------------------------------");
        }
        else
        {
            logmsg("FPGA license accepted with status ", response[0]);
        }

